Revit 2020 API
View.GetFilters Method
 Gets the filters applied to the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public ICollection<ElementId> GetFilters()
Visual Basic
Public Function GetFilters As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetFilters()
Return Value
 The ElementIds of the Filters.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  View does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
View Class
Autodesk.Revit.DB Namespace